set -e # 에러 발생 시 즉시 중단하여 잘못된 파일이 배포되지 않도록 방지

echo "======================================"
echo "[1/4] 최신 코드 가져오기 (git pull)..."
echo "======================================"
git pull

echo "코드 가져오기 완료!"
echo ""
echo "=================================="
echo "[2/4] 패키지 설치(pnpm install)..."
echo "=================================="
cd frontend
pnpm install

echo "패키지 설치 완료!"
echo ""
echo "====================================="
echo "[3/4] 프론트엔드 빌드 (pnpm build)..."
echo "====================================="
pnpm build

echo "블드 완료!"
echo ""
echo "================================"
echo "[4/4] Nginx 웹 루트로 배포 중..."
echo "================================"
sudo cp -r dist/* /var/www/html/

echo "Nginx 루트 배포 완료!"
echo ""
echo "=================================================="
echo "배포 완료!"
echo "브라우저에서 [Ctrl + Shitf + R]을 눌러 확인하세요!"
echo "=================================================="


